# EA_ConvDoc2X

## Description
Converts value from document unit to X unit and returns the result as real number.

```pascal
FUNCTION EA_ConvDoc2X(
				unitType : INTEGER;
				value    : REAL) : REAL;
```

```python

def vs.EA_ConvDoc2X(unitType, value):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|unitType|INTEGER||
|value|REAL||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library